nxp-mcuxpresso/sbl/target/evkmimxrt500/board/mcu_isp/clock_config_IMXRT500.c
/*
 * Copyright 2017-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "bootloader/bl_context.h"
#include "bootloader_common.h"
#include "bootloader/bl_log.h"
#include "fsl_clock.h"
#include "fsl_device_registers.h"
#if BL_FEATURE_FLEXSPI_NOR_MODULE
#include "fsl_flexspi.h"
#endif
#include "fusemap.h"
#include "microseconds/microseconds.h"
#include "property/property.h"
#include "target_config.h"
#include "utilities/fsl_assert.h"
#include "bootloader/bootloader.h"

////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////
typedef enum boot_power
{
    kBootPower_Normal, //!< Boot at 96MHz
    kBootPower_High    //!< Boot at 198MHz, high performance, high power consumption
} boot_power_t;

enum
{
    kFreq_1MHz = 1000000u,
    kFreq_4MHz = 4u * kFreq_1MHz,
    kFreq_24MHz = 24u * kFreq_1MHz,
    kFreq_48MHz = 48u * kFreq_1MHz,
    kFreq_44MHz = 44u * kFreq_1MHz,
    kFreq_192MHz = 192u * kFreq_1MHz,
    kFreq_198MHz = 198u * kFreq_1MHz,
    kFreq_264MHz = 264u * kFreq_1MHz,
    kFreq_16MHz = 16u * kFreq_1MHz,
    kFreq_96MHz = 96u * kFreq_1MHz,
    kFreq_240MHz = 240u * kFreq_1MHz,
    kFreq_133MHz = 133u * kFreq_1MHz,
    kFreq_132MHz = 132u * kFreq_1MHz,
    kFreq_144MHz = 144u * kFreq_1MHz,
    kFreq_166MHz = 166u * kFreq_1MHz,
    kFreq_200MHz = 200u * kFreq_1MHz,
    kDefaultUsbPllLockTimeUs = 200000u,

};

enum
{
    MAINCLKSELA_1M_LPOSC = 0,
    MAINCLKSELA_FRO_DIV, // Div from FRO192M (96M,48M,24M,12M)
    MAINCLKSELA_OSC_CLK,
    MAINCLKSELA_FRO_192M,
};

enum
{
    PLL528_CLKSRC_FRO_24M = 0,
    PLL528_CLKSRC_OSC,
};

enum
{
    MAINCLKSELB_SYSCLK = 0,
    MAINCLKSELB_MAIN_PLL_CLK, // MAIN PLL PFD0
    MAINCLKSELB_32K_CLK
};

enum
{
    SYSOSCSEL_XTAL_CLK = 0,
    SYSOSCSEL_CLKIN_CLK,
};

enum
{
    USBHSFCLKSEL_OSC_CLK = 0,
    USBHSFCLKSEL_MAIN_CLK,
    USBHSFCLKSEL_FRO_24M
};

enum
{
    kFlexSpiClockSrc_MainClk = 0,
    kFlexSpiClockSrc_MainPllClk,
    kFlexSpiClockSrc_Aux0PllClk,
    kFlexSpiClockSrc_FRO192M_Clk,
    kFlexSpiClockSrc_Aux1PllClk,
};

#if defined BL_TARGET_FPGA
uint32_t busClock = 1000000u; //! 6MHz default bus clock
#endif

////////////////////////////////////////////////////////////////////////////////
// Prototypes
////////////////////////////////////////////////////////////////////////////////
static secure_bool_t isOscInited = kSecure_False;
static boot_power_t get_boot_power(void);
static void boot_set_clocks(boot_power_t boot_power);
static void init_syspll(uint32_t clk_src, uint32_t src_clk_freq);
static void init_sysosc(void);
static void delay_us_sw(uint32_t us);
extern void pmc_apply_cfg(void);
status_t flexspi_nor_set_clock_source(uint32_t clockSource);
void init_pll_use_xtal(void);
////////////////////////////////////////////////////////////////////////////////
// Code
////////////////////////////////////////////////////////////////////////////////

void delay_us_sw(uint32_t us)
{
    uint32_t ticksPerUs = SystemCoreClock / kFreq_1MHz;

    while (us--)
    {
        volatile uint32_t delayTicks = 1 + ticksPerUs / 4;
        while (--delayTicks)
        {
            __NOP();
        }
    }
}

enum
{
    kClockFreq_16MHz = 0,
    kClockFreq_19MHz,
    kClockFreq_24MHz,
    kClockFreq_26MHz,
    kClockFreq_30MHz,
} src_clk_freq;

void init_syspll(uint32_t clk_src, uint32_t src_clk_freq)
{
    SYSCTL0->PDRUNCFG0_CLR = SYSCTL0_PDRUNCFG0_SYSPLLLDO_PD_MASK | SYSCTL0_PDRUNCFG0_SYSPLLANA_PD_MASK;
    // Add a delay to make sure the osc_clk is ready before change the
    // syspll clock source to osc_clk or PLL will not lock up.
    delay_us_sw(100u);
    if (PLL528_CLKSRC_FRO_24M != clk_src)
    {
        // Reference clock change from  FRO24M to OSC CLK,needs an power down sequence
        SYSCTL0->PDRUNCFG0_SET = SYSCTL0_PDRUNCFG0_SYSPLLLDO_PD_MASK | SYSCTL0_PDRUNCFG0_SYSPLLANA_PD_MASK;
        CLKCTL0->SYSPLL0CLKSEL = clk_src;
        delay_us_sw(100u);
        SYSCTL0->PDRUNCFG0_CLR = SYSCTL0_PDRUNCFG0_SYSPLLLDO_PD_MASK | SYSCTL0_PDRUNCFG0_SYSPLLANA_PD_MASK;
        delay_us_sw(100u);
    }
    else
    {
        CLKCTL0->SYSPLL0CLKSEL = clk_src;
    }

    if (kClockFreq_24MHz == src_clk_freq)
    {
        CLKCTL0->SYSPLL0NUM = 0x0u;
        CLKCTL0->SYSPLL0DENOM = 0x01u;
        // Configure to 528M, assert HOLDRINGOFF in the first half of lock time
        CLKCTL0->SYSPLL0CTL0 = CLKCTL0_SYSPLL0CTL0_MULT(22u) | CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA_MASK;
        delay_us_sw(CLKCTL0->SYSPLL0LOCKTIMEDIV2 / 2);
        // De-assert HOLDRINGOFF in the second half of lock time
        CLKCTL0->SYSPLL0CTL0 &= (uint32_t)~CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA_MASK;
        delay_us_sw(CLKCTL0->SYSPLL0LOCKTIMEDIV2 / 2);
    }
    else if (kClockFreq_16MHz == src_clk_freq)
    {
        CLKCTL0->SYSPLL0NUM = 0x0u;
        CLKCTL0->SYSPLL0DENOM = 0x01u;
        // Configure to 528M, assert HOLDRINGOFF in the first half of lock time
        CLKCTL0->SYSPLL0CTL0 = CLKCTL0_SYSPLL0CTL0_MULT(33u) | CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA_MASK;
        delay_us_sw(CLKCTL0->SYSPLL0LOCKTIMEDIV2 / 2);
        // De-assert HOLDRINGOFF in the second half of lock time
        CLKCTL0->SYSPLL0CTL0 &= (uint32_t)~CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA_MASK;
        delay_us_sw(CLKCTL0->SYSPLL0LOCKTIMEDIV2 / 2);
    }
}
void init_sysosc(void)
{
    if (isOscInited == kSecure_False)
    {
        SYSCTL0->PDRUNCFG0_CLR = SYSCTL0_PDRUNCFG0_SYSXTAL_PD_MASK;
        __DSB();
        __ISB();
        CLKCTL0->SYSOSCCTL0 = CLKCTL0_SYSOSCCTL0_LP_ENABLE(1) | CLKCTL0_SYSOSCCTL0_BYPASS_ENABLE(0);

        CLKCTL0->SYSOSCBYPASS = CLKCTL0_SYSOSCBYPASS_SEL(SYSOSCSEL_XTAL_CLK);

        // Wait until OSC gets stable
//        uint32_t sysOscStableUsFuseIdx = 14;
        uint32_t sysOscStableUsFuseValue = 0;
        /*
        status_t status = otp_fuse_read(sysOscStableUsFuseIdx, &sysOscStableUsFuseValue);

        if (status != kStatus_Success)
        {
            go_fatal_mode();
        }
        */

        delay_us_sw(sysOscStableUsFuseValue);
        isOscInited = kSecure_True;
    }
}
boot_power_t get_boot_power(void)
{
    boot_power_t bootPower = kBootPower_Normal;
    if (OTP_BOOTSPEED_VALUE())
    {
        bootPower = kBootPower_High;
    }

    return bootPower;
}

void boot_set_clocks(boot_power_t boot_power)
{
  
