nxp-mcuxpresso/sbl/target/evkmimxrt500/board/mcu_isp/clock_config_IMXRT500.c
#ifndef BL_TARGET_FPGA

    if (!OTP_BOOT_CLOCK_USE_XTAL_TO_PLL_VALUE())
    {
        if (boot_power == kBootPower_High)
        {
            debug_printf("%s, PLL will use FRO24M as input", __func__);

            debug_printf("%s, FFRO enabled", __func__);
            // Enable the FRO192M FRO48M FRO24M(Main PLL source)
            CLKCTL0->FRODIVOEN = CLKCTL0_FRODIVOEN_FRO_DIV1_O_EN_MASK | CLKCTL0_FRODIVOEN_FRO_DIV4_O_EN_MASK |
                                  CLKCTL0_FRODIVOEN_FRO_DIV8_O_EN_MASK;

            // Configure Clock to certain state before swithching to PLL
            CLKCTL0->MAINCLKSELB = MAINCLKSELB_SYSCLK;
            CLKCTL0->MAINCLKSELA = MAINCLKSELA_FRO_192M;

            // Increase the core voltage to 1.138v before setting the PLL
            PMC->RUNCTRL = PMC_RUNCTRL_CORELVL(0x32);
            pmc_apply_cfg();

            // PLL_OUTPUT = 24MHz * (22 + 0 / 1) = 528MHz
            SystemCoreClock = kFreq_48MHz;
            init_syspll(PLL528_CLKSRC_FRO_24M, kClockFreq_24MHz);
            // MAIN_PLL = 396MHz
            CLOCK_InitSysPfd(kCLOCK_Pfd0, 24u);

            // When in High power boot check whether this is RT3xx part, if yes, core clock max boot clock limit to
            // 132Mhz

            {
                debug_printf("%s,This RT5XX part", __func__);
                // 396MHz / 2 = 198MHz
                CLKCTL0->SYSCPUAHBCLKDIV = (2u - 1u);
                SystemCoreClock = kFreq_198MHz;
                // for glitch free clock swiching. Select the divider clock first then enable divider.
                CLKCTL0->SYSTICKFCLKSEL = 0u;
                CLKCTL0->SYSTICKFCLKDIV = (2u - 1u);
            }

            // Switch to MAIN PLL
            CLKCTL0->MAINCLKSELB = MAINCLKSELB_MAIN_PLL_CLK;
            __ISB();
            __DSB();
            // Configure FLEXSPI Clock to AUX0_PLL, so it is possible to achieve 100MHz DDR read when the core is
            // running at
            // 200MHz
            flexspi_nor_set_clock_source(kFlexSpiClockSrc_Aux0PllClk);
        }
        else
        {
            debug_printf("%s, FFRO enabled", __func__);
            // Enable the FRO192M FRO48M
            CLKCTL0->FRODIVOEN = CLKCTL0_FRODIVOEN_FRO_DIV1_O_EN_MASK | CLKCTL0_FRODIVOEN_FRO_DIV4_O_EN_MASK |
                                  CLKCTL0_FRODIVOEN_FRO_DIV8_O_EN_MASK;

            // Set FRO192M as clock source, core run at 192MHz / 4 = 48Mhz
            CLKCTL0->SYSCPUAHBCLKDIV = (4 - 1u);
            CLKCTL0->SYSTICKFCLKSEL = 0;
            CLKCTL0->SYSTICKFCLKDIV = (4 - 1u);
            CLKCTL0->MAINCLKSELA = MAINCLKSELA_FRO_192M;
            CLKCTL0->MAINCLKSELB = MAINCLKSELB_SYSCLK;

            // Intialize the PLL for uSDHC
            init_syspll(PLL528_CLKSRC_FRO_24M, kClockFreq_24MHz);
            // MAIN_PLL = 396MHz
            CLOCK_InitSysPfd(kCLOCK_Pfd0, 24u);

            SystemCoreClock = kFreq_48MHz;

            // Configure FLEXSPI Clock to AUX0_PLL, so it is possible to achieve 100MHz DDR read when the core is
            // running at
            // 200MHz
            flexspi_nor_set_clock_source(kFlexSpiClockSrc_Aux0PllClk);
        }

        // Select UART0 Clock source
        CLKCTL1->FLEXCOMM[0].FCFCLKSEL = 0x00u; // IRC48M
    }
    else
    {
        if (boot_power == kBootPower_High)
        {
            debug_printf("%s, PLL will use XTAL as input", __func__);

            init_pll_use_xtal();
            debug_printf("%s, FFRO enabled", __func__);
            // Enable the FRO192M FRO48M
            CLKCTL0->FRODIVOEN = CLKCTL0_FRODIVOEN_FRO_DIV1_O_EN_MASK | CLKCTL0_FRODIVOEN_FRO_DIV4_O_EN_MASK;
            
            // When in High power boot check whether this is RT3xx part, if yes, core clock max boot clock limit to
            // 132Mhz

            {
                debug_printf("%s,This RT5XX part", __func__);
                // Set FRO192M as clock source, core run at 192MHz
                CLKCTL0->SYSCPUAHBCLKDIV = (1 - 1u);
                CLKCTL0->SYSTICKFCLKSEL = 0;
                CLKCTL0->SYSTICKFCLKDIV = (1 - 1u);
                SystemCoreClock = kFreq_192MHz;
            }
            
            debug_printf("%s,Swicth to FRO192", __func__);

            CLKCTL0->MAINCLKSELA = MAINCLKSELA_FRO_192M;
            CLKCTL0->MAINCLKSELB = MAINCLKSELB_SYSCLK;

            __DSB();
            __ISB();

            // Configure FLEXSPI Clock to AUX0_PLL, so it is possible to achieve 100MHz DDR read when the core is
            // running at
            // 200MHz
            flexspi_nor_set_clock_source(kFlexSpiClockSrc_Aux0PllClk);
        }
        else
        {
            debug_printf("%s, PLL will use XTAL as input", __func__);

            init_pll_use_xtal();

            debug_printf("%s, FFRO enabled", __func__);

            // Enable the FRO192M FRO48M
            CLKCTL0->FRODIVOEN = CLKCTL0_FRODIVOEN_FRO_DIV1_O_EN_MASK | CLKCTL0_FRODIVOEN_FRO_DIV4_O_EN_MASK;
            
            // Set FRO192M as clock source, core run at 192MHz / 4 = 48Mhz
            CLKCTL0->SYSCPUAHBCLKDIV = (4 - 1u);
            CLKCTL0->SYSTICKFCLKSEL = 0;
            CLKCTL0->SYSTICKFCLKDIV = (4 - 1u);
            CLKCTL0->MAINCLKSELA = MAINCLKSELA_FRO_192M;
            CLKCTL0->MAINCLKSELB = MAINCLKSELB_SYSCLK;
            __ISB();
            __DSB();

            SystemCoreClock = kFreq_48MHz;

            // Configure FLEXSPI Clock to AUX0_PLL, so it is possible to achieve 100MHz DDR read when the core is
            // running at
            // 200MHz
            flexspi_nor_set_clock_source(kFlexSpiClockSrc_Aux0PllClk);
        }

        // Select UART0 Clock source
        CLKCTL1->FLEXCOMM[0].FCFCLKSEL = 0x00u; // IRC48M
    }
    
#else // FPGA build

    SystemCoreClock = kFreq_48MHz;

    // UART0
    CLKCTL1->FLEXCOMM[0].FCFCLKSEL = 0x04u; // Clock source : FRG clock
    CLKCTL1->FLEXCOMM[0].FRGCLKSEL = 0u;
#endif
    
    
}

// See bootloader_common for documentation on this function.
void configure_clocks(bootloader_clock_option_t option)
{
    debug_printf("%s\n", __func__);
    boot_power_t boot_power = get_boot_power();

    // Configure Clock in ROM code
    if (kClockOption_EnterBootloader == option)
    {
        boot_set_clocks(boot_power);
    }
    else // Restore clock settings before leaving ROM code
    {
        // Restore UART clock settings
        CLKCTL1->FLEXCOMM[0].FCFCLKSEL = 0x07u;

