nxp-mcuxpresso/sbl/target/evkmimxrt500/board/mcu_isp/clock_config_IMXRT500.c
    }
}
// See bootloader_common.h for documentation on this function.
// Note: this function doesn't apply to FPGA build
uint32_t get_system_core_clock(void)
{
    return CLOCK_GetFreq(kCLOCK_CoreSysClk);
}

// See bootloader_common.h for documentation on this function.
uint32_t get_bus_clock(void)
{
    return get_system_core_clock();
}

status_t flexspi_nor_set_clock_source(uint32_t clockSource)
{
    status_t status = kStatus_InvalidArgument;

    do
    {
        if (clockSource > kFlexSpiClockSrc_Aux1PllClk)
        {
            break;
        }

        uint32_t currentClkSrc =
            (CLKCTL0->FLEXSPI0FCLKSEL & CLKCTL0_FLEXSPI0FCLKSEL_SEL_MASK) >> CLKCTL0_FLEXSPI0FCLKSEL_SEL_SHIFT;

        if (currentClkSrc != clockSource)
        {
            // Halt the clock before switching clock source to avoid potential glitch
            CLKCTL0->FLEXSPI0FCLKDIV |= (CLKCTL0_FLEXSPI0FCLKDIV_HALT_MASK);
            // Need some delay before changing OSPIFFCLKSEL
            __DSB();
            __ISB();
            // Switch clock source
            CLKCTL0->FLEXSPI0FCLKSEL = CLKCTL0_FLEXSPI0FCLKSEL_SEL(clockSource);
            // Need some delay before next step
            __DSB();
            __ISB();

            // Release the halt signal
            CLKCTL0->FLEXSPI0FCLKDIV &= ~CLKCTL0_FLEXSPI0FCLKDIV_HALT_MASK;
        }

        status = kStatus_Success;

    } while (0);

    return status;
}

#if BL_FEATURE_FLEXSPI_NOR_MODULE
/*
void flexspi_clock_config(uint32_t instance, uint32_t freqOption, uint32_t sampleClkMode)
{
#ifndef BL_TARGET_FPGA
    do
    {
        if ((freqOption < 1) || (freqOption > kFlexSpiSerialClk_200MHz) || (sampleClkMode > kFlexSpiClk_DDR))
        {
            break;
        }

        uint32_t clockSrc = (CLKCTL0->FLEXSPI0FCLKSEL & CLKCTL0_FLEXSPI0FCLKSEL_SEL_MASK) >> CLKCTL0_FLEXSPI0FCLKSEL_SEL_SHIFT;
        uint32_t clockDiv = 1;
        uint32_t currentDiv = (CLKCTL0->FLEXSPI0FCLKDIV & CLKCTL0_FLEXSPI0FCLKDIV_DIV_MASK) >> CLKCTL0_FLEXSPI0FCLKDIV_DIV_SHIFT;
        uint32_t needHaltClk = 0;

        if (clockSrc == kFlexSpiClockSrc_FRO192M_Clk)
        {
            if (sampleClkMode == kFlexSpiClk_SDR)
            {
                switch (freqOption)
                {
                    default:
                    case kFlexSpiSerialClk_32MHz:
                        clockDiv = 6; // 32Mhz
                        break;
                    case kFlexSpiSerialClk_48MHz:
                        clockDiv = 4; // 48Mhz
                        break;
                    case kFlexSpiSerialClk_64MHz:
                        clockDiv = 3; // 64Mhz
                        break;
                    case kFlexSpiSerialClk_96MHz:
                        clockDiv = 2; // 96Mhz
                        break;
                    case kFlexSpiSerialClk_192MHz:
                        clockDiv = 1; // 192Mhz
                        break;
                }
            }
            else // DDR mode
            {
                switch (freqOption)
                {
                    default:
                    case kFlexSpiSerialClk_32MHz:
                        clockDiv = 3; // 192 / 3 / 2 = 32Mhz
                        break;
                    case kFlexSpiSerialClk_48MHz:
                        clockDiv = 2; // 192 / 2 / 2 = 48Mhz
                        break;
                    case kFlexSpiSerialClk_96MHz:
                        clockDiv = 1; // 192 / 1 / 2 = 96Mhz
                        break;
                }
            }
        }

        if ((clockSrc == kFlexSpiClockSrc_MainClk) || (clockSrc == kFlexSpiClockSrc_MainPllClk))
        {
            uint32_t flexspiSrcClk = CLOCK_GetMainClkFreq();
            if (clockSrc == kFlexSpiClockSrc_MainPllClk)
            {
                flexspiSrcClk = CLOCK_GetSysPfdFreq(kCLOCK_Pfd0);
            }

            uint32_t freqList[] = { 30, 30, 50, 60, 80, 100, 120, 133, 166, 200 };

            clockDiv = 1;
            uint32_t freqMHz = flexspiSrcClk / kFreq_1MHz;
            if (sampleClkMode == kFlexSpiClk_DDR)
            {
                freqMHz /= 2;
            }
            bool hasFoundDiv = false;

            while (!hasFoundDiv)
            {
                uint32_t divFreq = freqMHz / clockDiv;
                if (divFreq <= freqList[freqOption])
                {
                    hasFoundDiv = true;
                    break;
                }
                else
                {
                    ++clockDiv;
                }
            }
        }
        else if ((clockSrc == kFlexSpiClockSrc_Aux0PllClk) || (clockSrc == kFlexSpiClockSrc_Aux1PllClk))
        {
            uint32_t expectedPfd = 24; // Aux0_pll will be configured to 396MHz
            if (sampleClkMode == kFlexSpiClk_SDR)
            {
                switch (freqOption)
                {
                    default:
                    case kFlexSpiSerialClk_30MHz:
                        clockDiv = 13; // 528 * 18 / 24 / 13 = 30.46
                        break;
                    case kFlexSpiSerialClk_50MHz:
                        clockDiv = 8; // 528 * 18 / 24 / 8 = 49
                        break;
                    case kFlexSpiSerialClk_60MHz:
                        expectedPfd = 32;
                        clockDiv = 5; // 528 * 18 / 32 / 5 = 59.4
                        break;
                    case kFlexSpiSerialClk_80MHz:
                        expectedPfd = 20;
                        clockDiv = 6; // 528 * 18 / 20 / 6 = 79.2
                        break;
                    case kFlexSpiSerialClk_100MHz:
                        clockDiv = 4; // 528 * 18 / 24 / 6 = 99
                        break;
                    case kFlexSpiSerialClk_120MHz:
                        expectedPfd = 27; // 528 * 18 / 27 / 6 = 117
                        clockDiv = 3;
                        break;
                    case kFlexSpiSerialClk_133MHz:
                        clockDiv = 3; // 528 * 18 / 24 / 3 = 132
                        break;
                    case kFlexSpiSerialClk_166MHz:
                        expectedPfd = 29; // 528 * 18 / 29 / 2 = 163
                        clockDiv = 2;
                        break;
                    case kFlexSpiSerialClk_200MHz:
                        clockDiv = 2; // 528 * 18 / 24 / 2 = 198
                        break;
                }
            }
            else
            {
                expectedPfd = 24; // Aux0_pll will be configured to 396MHz
                switch (freqOption)
                {
                    default:
                    case kFlexSpiSerialClk_30MHz:
                        expectedPfd = 32;
                        clockDiv = 5; // 528 * 18 / 32 / 5 / 2 = 29.7
                        break;
                    case kFlexSpiSerialClk_50MHz:
                        clockDiv = 4; // 528 * 18 / 24 / 4 /2 = 49.5
                        break;
                    case kFlexSpiSerialClk_60MHz:
                        expectedPfd = 26;
                        clockDiv = 3; // 528 * 18 / 26 / 3 /2 = 60.8
                        break;
                    case kFlexSpiSerialClk_80MHz:
                        expectedPfd = 29;
                        clockDiv = 2; // 528 * 18 / 29 / 2 / 2 = 81.75
                        break;
                    case kFlexSpiSerialClk_100MHz:
                        clockDiv = 2; // 528 * 18 / 24 / 2 / 2  = 99
                        break;
                    case kFlexSpiSerialClk_120MHz:
                        expectedPfd = 20; // 528 * 18 / 20 / 2 / 2  = 118.75
                        clockDiv = 2;
                        break;
                    case kFlexSpiSerialClk_133MHz:
                        expectedPfd = 12; // 528 * 18 / 12 / 3 / 2  = 132
                        clockDiv = 3;
                        break;
                    case kFlexSpiSerialClk_166MHz:
                        expectedPfd = 29; // 528 * 18 / 29 / 1 / 2 = 163.8
                        clockDiv = 1;
                        break;
                    case kFlexSpiSerialClk_200MHz:
                        clockDiv = 1; // 528 * 18 / 24 / 1 / 2 = 198
                        break;
                }
            }
            uint32_t currentPfd = 0;

            if (clockSrc == kFlexSpiClockSrc_Aux0PllClk)
            {
                currentPfd = (CLKCTL0->SYSPLL0PFD & CLKCTL0_SYSPLL0PFD_PFD2_MASK) >> CLKCTL0_SYSPLL0PFD_PFD2_SHIFT;
            }
            else
            {
                currentPfd = (CLKCTL0->SYSPLL0PFD & CLKCTL0_SYSPLL0PFD_PFD3_MASK) >> CLKCTL0_SYSPLL0PFD_PFD3_SHIFT;
            }
            uint32_t currentClkSrc =
                (CLKCTL0->FLEXSPI0FCLKSEL & CLKCTL0_FLEXSPI0FCLKSEL_SEL_MASK) >> CLKCTL0_FLEXSPI0FCLKSEL_SEL_SHIFT;

            needHaltClk = (currentDiv != clockDiv) || (currentPfd != expectedPfd) || (clockSrc != currentClkSrc);

            if (needHaltClk)
            {
                // Halt the counter if PDF reconfiguration is required to avoid possible glitch
                CLKCTL0->FLEXSPI0FCLKDIV |= (CLKCTL0_FLEXSPI0FCLKDIV_HALT_MASK);
            }

            // Need some delay before changing OSPIFFCLKSEL
            __DSB();
            __ISB();
            // Switch clock source
            CLKCTL0->FLEXSPI0FCLKSEL = CLKCTL0_FLEXSPI0FCLKSEL_SEL(clockSrc);

            if (currentPfd != expectedPfd)
            {
                // Reconfigure PFD
                if (clockSrc == kFlexSpiClockSrc_Aux0PllClk)
                {
                    CLOCK_InitSysPfd(kCLOCK_Pfd2, expectedPfd);
                }
                else
                {
                    CLOCK_InitSysPfd(kCLOCK_Pfd3, expectedPfd);
                }
                __DSB();
                __ISB();
            }
        }

        // Update clock divider
        CLKCTL0->FLEXSPI0FCLKDIV = CLKCTL0_FLEXSPI0FCLKDIV_DIV(clockDiv - 1);
    } while (0);
#else
    // FPGA build
    CLKCTL0->OSPIFCLKDIV = 0u;                           // Clock divider = 1
    CLKCTL0->OSPIFFCLKSEL = CLKCTL0_OSPIFFCLKSEL_SEL(0); // Main clock
#endif
}

