nxp-mcuxpresso/sbl/target/evkmimxrt500/board/mcu_isp/clock_config_IMXRT500.c
void flexspi_clock_disable(void)
{
    CLKCTL0->PSCCTL0_CLR = CLKCTL0_PSCCTL0_CLR_FLEXSPI0_OTFAD_CLK_MASK;
}

void flexspi_clock_enable(void)
{
    CLKCTL0->PSCCTL0_SET = CLKCTL0_PSCCTL0_SET_FLEXSPI0_OTFAD_CLK_MASK;
}
*/
#endif


bool usb_hs0_device_clock_enable(void)
{
    // USB boot will assume 24MHz for phase 1 ROM. In phase 2 auto-detection
    //  of XTAL frequency will be implemented using "Frequency measure" module.
    debug_printf("Bootloader: ----%s\n", __func__);
#ifndef BL_TARGET_FPGA
    //    /* disable usbhs device clock */
    //    CLOCK_DisableClock(kCLOCK_UsbhsDevice);

    /* Init system osc */
    init_sysosc();

    CLKCTL0->USBHSFCLKSEL = 0;
    CLKCTL0->USBHSFCLKDIV = 0;

    /* Enbale clock for usb1 phy */
    CLKCTL0->PSCCTL0_SET = (1u << 20);
    RSTCTL0->PRSTCTL0_CLR = (1u << 20);
    if (SystemCoreClock < (66 * 1000 * 1000))
    {
        CLKCTL0->PFCDIV[1] = 0;
    }
    else
    {
        CLKCTL0->PFCDIV[1] = 0x03;
    }
    __DSB();
    __ISB();

    // set up the PHY
    USBPHY->CTRL_CLR = USBPHY_CTRL_SFTRST_MASK;  // release PHY from reset
    USBPHY->CTRL_CLR = USBPHY_CTRL_CLKGATE_MASK; // Clear to 0 to run clocks

    /* Enable PLL regulator and wait a while for its stable */
    USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_REG_ENABLE_MASK;
    /* Design suggest 15us, we delay 50us for sure */
    microseconds_delay(50);

    // power up PLL, regulator enable
    uint32_t pll_div = OTP_USB_PLL_DIV_SEL_VALUE();
    if (pll_div == 0)
    {
        pll_div = 3; // Assume 24MHz clock by default
    }
    

    /* Select MULT for USB PLL */
    USBPHY->PLL_SIC = (USBPHY->PLL_SIC & ~(USBPHY_PLL_SIC_PLL_DIV_SEL_MASK)) | USBPHY_PLL_SIC_PLL_DIV_SEL(pll_div);
    microseconds_delay(65);
    /* Power on USB PLL */
    uint32_t retryCnt = 0;
    USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_SET_PLL_POWER(1);
	
    while (!(USBPHY->PLL_SIC & USBPHY_PLL_SIC_SET_PLL_POWER_MASK))
    {
        USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_SET_PLL_POWER(1);
        ++retryCnt;
    }

    debug_printf("Need %d time to set USBPHY_PLL_SIC_POWR bit", retryCnt);

    /* Polling PLLs lock bit */
    uint32_t usbPllLockTimeUs =
        SYSCTL0->USBPHYPLL0LOCKTIMEDIV2 ? SYSCTL0->USBPHYPLL0LOCKTIMEDIV2 : kDefaultUsbPllLockTimeUs;
    uint32_t timeoutTicks = SystemCoreClock / kFreq_1MHz * usbPllLockTimeUs / 4;
    do
    {
        --timeoutTicks;
        if (timeoutTicks < 1)
        {
            break;
        }
    }while (!(USBPHY->PLL_SIC & USBPHY_PLL_SIC_PLL_LOCK_MASK));
    
    if (!(USBPHY->PLL_SIC & USBPHY_PLL_SIC_PLL_LOCK_MASK))
    {
         return false;
    }
    

    /* Wait more time in case HW LOCK time is not enough */
    microseconds_delay(50);

    /* Clear USBPLL bypass bit */
    USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_BYPASS_MASK;
    retryCnt = 0;
    while (USBPHY->PLL_SIC & USBPHY_PLL_SIC_PLL_BYPASS_MASK)
    {
        USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_BYPASS_MASK;
        ++retryCnt;
    }
    debug_printf("Need %d time to clear USBPHY_PLL_SIC_BYPASS bit", retryCnt);

    /* Enable clock output from USB PLL and USB PHY */
    USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_ENABLE(1) | USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS(1);
    retryCnt = 0;
    
    while ((USBPHY->PLL_SIC & (USBPHY_PLL_SIC_PLL_ENABLE(1) | USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS(1))) !=
           (USBPHY_PLL_SIC_PLL_ENABLE(1) | USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS(1)))
    {
        USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_ENABLE(1) | USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS(1);
        ++retryCnt;
    }
    debug_printf("Need %d time to set USBPHY_PLL_SIC_SET_PLL_ENABLE and USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS bit", retryCnt);

    /*Clear power down register */
    USBPHY->PWD = 0;

    debug_printf("Enter 5 --- %s, ", __func__);

    // Power on USB
    SYSCTL0->PDRUNCFG0_CLR = SYSCTL0_PDRUNCFG0_CLR_HSPAD_FSPI0_VDET_LP_MASK;
    /* Power up all necessary modules */
    SYSCTL0->PDRUNCFG1_CLR = SYSCTL0_PDRUNCFG1_USBHS_SRAM_APD_MASK | SYSCTL0_PDRUNCFG1_USBHS_SRAM_PPD_MASK;
    /* Enable usbhs device and ram clock */
    CLOCK_EnableClock(kCLOCK_UsbhsDevice);
    CLOCK_EnableClock(kCLOCK_UsbhsSram);

#endif

    return true;
}

void init_pll_use_xtal()
{
    // init sysosc
    init_sysosc();
    // Increase the core voltage to 1.138v before setting the PLL
    PMC->RUNCTRL = PMC_RUNCTRL_CORELVL(0x32);
    pmc_apply_cfg();
    // init PLL using osc clk

    if (OTP_BOOT_CLOCK_XTAL_FREQ_VALUE())
    {
        // Enable PLL use XTAL 16Mhz
        init_syspll(PLL528_CLKSRC_OSC, kClockFreq_16MHz);
        debug_printf("%s, PLL enabled using XTAL 16Mhz", __func__);
    }
    else
    {
        // Enable PLL use XTAL 24Mhz
        init_syspll(PLL528_CLKSRC_OSC, kClockFreq_24MHz);
        debug_printf("%s, PLL enabled using XTAL 24Mhz", __func__);
    }

    // MAIN_PLL = 396MHz
    CLOCK_InitSysPfd(kCLOCK_Pfd0, 24u);
}
////////////////////////////////////////////////////////////////////////////////
// EOF
////////////////////////////////////////////////////////////////////////////////
